
#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовоеОписаниеТипа() Экспорт
	Описание = Новый Структура;
	
	Описание.Вставить("БазовыйТип", ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.ПустаяСсылка"));
	
	Описание.Вставить("ДлинаЧисла", 0);
	Описание.Вставить("ТочностьЧисла", 0);
	Описание.Вставить("НеотрицательноеЧисло", Ложь);
	
	Описание.Вставить("ДлинаСтроки", 0);
	Описание.Вставить("СтрокаНеограниченнойДлины", Ложь);
	
	Описание.Вставить("ДатаСВременем", Ложь);
	
	Возврат Описание;
КонецФункции

Процедура ОчиститьНеиспользуемыеПоля(Описание) Экспорт
	Если Описание.БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Число") Тогда
		Описание.ДлинаСтроки = 0;
		Описание.СтрокаНеограниченнойДлины = Ложь;
		
		Описание.ДатаСВременем = Ложь;
	ИначеЕсли Описание.БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Строка") Тогда
		Описание.ДлинаЧисла = 0;
		Описание.ТочностьЧисла = 0;
		Описание.НеотрицательноеЧисло = Ложь;
		
		Описание.ДатаСВременем = Ложь;
	ИначеЕсли Описание.БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Дата") Тогда
		Описание.ДлинаЧисла = 0;
		Описание.ТочностьЧисла = 0;
		Описание.НеотрицательноеЧисло = Ложь;
		
		Описание.ДлинаСтроки = 0;
		Описание.СтрокаНеограниченнойДлины = Ложь;
	Иначе
		Описание.ДлинаЧисла = 0;
		Описание.ТочностьЧисла = 0;
		Описание.НеотрицательноеЧисло = Ложь;
		
		Описание.ДлинаСтроки = 0;
		Описание.СтрокаНеограниченнойДлины = Ложь;
		
		Описание.ДатаСВременем = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
