
#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьОбъектXDTO(ВерсияФормата, ИмяТипаОбъекта) Экспорт
	Тип = ФабрикаXDTO.Тип(СтрШаблон("http://comparator.iryaboff.ru/v%1/", Формат(ВерсияФормата, "ЧГ=")), ИмяТипаОбъекта);
	Возврат ФабрикаXDTO.Создать(Тип, Неопределено);
КонецФункции

Функция СтрокаВОбъектXDTO(Строка, ОжидаемыйТип) Экспорт
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Строка);
	
	Объект = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ОжидаемыйТип);
	ЧтениеXML.Закрыть();
	
	Возврат Объект;
КонецФункции

#КонецОбласти
