
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" И Не ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Ключ")) Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Документ.СравнениеДанных.Форма.ФормаИмпортаВыгрузки";
	КонецЕсли;
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Формирует таблицы движений для документа
//
// Параметры:
//  Ссылка - ДокументСсылка.СравнениеДанных -
//
// Возвращаемое значение:
//  Структура:
//  * СравненияДанных - ТаблицаЗначений
Функция ДанныеДляПроведенияДокумента(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СравнениеДанных.ИдентификаторВыгрузки КАК ИдентификаторВыгрузки,
		|	СравнениеДанных.Статус КАК Статус
		|ИЗ
		|	Документ.СравнениеДанных КАК СравнениеДанных
		|ГДЕ
		|	СравнениеДанных.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Новый Структура("СравненияДанных", РезультатЗапроса.Выгрузить());
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
