
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеДокументов.СоздатьИЗаписатьДвиженияПриПроведении(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеДокументов.УдалитьВсеДвиженияОбъекта(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСтатус() Экспорт
	Если Статус = Перечисления.СтатусыДокументаСравнениеДанных.ВыполняетсяСравнение Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыДокументаСравнениеДанных.СравнениеЗавершено Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыДокументаСравнениеДанных.СравнениеОтменено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыгрузкиДанных.База КАК База
		|ИЗ
		|	РегистрСведений.ВыгрузкиДанных КАК ВыгрузкиДанных
		|ГДЕ
		|	ВыгрузкиДанных.Документ = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() <= 1 Тогда
		Статус = Перечисления.СтатусыДокументаСравнениеДанных.ОжидаетсяВыгрузкаИзДругойБазы;
	Иначе
		Статус = Перечисления.СтатусыДокументаСравнениеДанных.ОжидаетсяСравнение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
