
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьВОбъектXDTO(Ссылка) Экспорт
	ПравилоСравненияXDTO = ОбщегоНазначенияСравнитель.СоздатьОбъектXDTO(1, "ПравилоСравненияДанных");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаСравненияДанных.ПриОпределенииБазы КАК ПриОпределенииБазы
		|ИЗ
		|	Справочник.ПравилаСравненияДанных КАК ПравилаСравненияДанных
		|ГДЕ
		|	ПравилаСравненияДанных.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаСравненияДанныхПараметрыСравнения.Имя КАК Имя,
		|	ПравилаСравненияДанныхПараметрыСравнения.Тип КАК Тип
		|ИЗ
		|	Справочник.ПравилаСравненияДанных.ПараметрыСравнения КАК ПравилаСравненияДанныхПараметрыСравнения
		|ГДЕ
		|	ПравилаСравненияДанныхПараметрыСравнения.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаСравненияДанныхПараметрыСравнения.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицыДанных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТаблицыДанных КАК ТаблицыДанных
		|ГДЕ
		|	ТаблицыДанных.Владелец = &Ссылка
		|	И ТаблицыДанных.Используется";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаПараметры = РезультатЗапроса[1].Выбрать();
	ВыборкаТаблицы = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаШапка.Следующий() Цикл
		ПравилоСравненияXDTO.ПриОпределенииБазы = ВыборкаШапка.ПриОпределенииБазы;
	КонецЦикла;
	
	Пока ВыборкаПараметры.Следующий() Цикл
		ПараметрXDTO = ОбщегоНазначенияСравнитель.СоздатьОбъектXDTO(1, "ПравилоСравненияДанных.ПараметрСравненияДанных");
		ПараметрXDTO.Имя = ВыборкаПараметры.Имя;
		ПараметрXDTO.Тип = Справочники.ОписанияТипов.ВыгрузитьВОбъектXDTO(ВыборкаПараметры.Тип);
		ПравилоСравненияXDTO.ПараметрыСравнения.Добавить(ПараметрXDTO);
	КонецЦикла;
	
	Пока ВыборкаТаблицы.Следующий() Цикл
		ТаблицаXDTO = Справочники.ТаблицыДанных.ВыгрузитьВОбъектXDTO(ВыборкаТаблицы.Ссылка);
		ПравилоСравненияXDTO.ТаблицыДанных.Добавить(ТаблицаXDTO);
	КонецЦикла;
	
	ПравилоСравненияXDTO.Проверить();
	Возврат ПравилоСравненияXDTO;
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
