///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет символы национального алфавита
//
// Параметры:
//   СимволыНациональногоАлфавита - Строка
//   ДополнительныеДопустимыеСимволы - Строка
//
Процедура ПриОпределенииСимволовНациональногоАлфавита(СимволыНациональногоАлфавита, ДополнительныеДопустимыеСимволы) Экспорт
КонецПроцедуры

// Определяет коды символов, которые не считаются разделителем.
// Если явно не указан разделитель слов.
//
// Параметры:
//   Диапазоны - Массив из Структура:
//    * Мин - Число - код символа, с которого начинается диапазон.
//    * Макс - Число - код символа, на котором заканчивается диапазон.
//
Процедура ПриОпределенииСимволовСлов(Диапазоны) Экспорт
КонецПроцедуры

#КонецОбласти



















