
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОписанияТипов.ОписаниеПоСсылке(Параметры.Ссылка));
	КонецЕсли;
	
	ВернутьСсылку = Параметры.ВернутьСсылку;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьКвалификатор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БазовыйТипПриИзменении(Элемент)
	УстановитьКвалификатор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ОписаниеТипа = ОписанияТиповКлиентСервер.НовоеОписаниеТипа();
	ЗаполнитьЗначенияСвойств(ОписаниеТипа, ЭтотОбъект);
	
	Если ВернутьСсылку Тогда
		Закрыть(ОписанияТиповВызовСервера.Ссылка(ОписаниеТипа));
	Иначе
		Закрыть(ОписаниеТипа);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьКвалификатор() Экспорт
	Если БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Число") Тогда
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.КвалификаторЧисла;
	ИначеЕсли БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Строка") Тогда
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.КвалификаторСтроки;
	ИначеЕсли БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Дата") Тогда
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.КвалификаторДаты;
	Иначе
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.ПустойКвалификатор;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
