
#Область ПрограммныйИнтерфейс

Асинх Функция СохранитьФайлНаУстройствоАсинх(АдресФайла, ПредлагаемоеИмяФайла, Фильтр) Экспорт
	#Если ВебКлиент Тогда
		ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
		Ждать ПолучитьФайлССервераАсинх(АдресФайла, ПредлагаемоеИмяФайла, ПараметрыДиалога);
	#Иначе
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Фильтр = Фильтр;
		Диалог.ПолноеИмяФайла = ПредлагаемоеИмяФайла;
		
		ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
		Если ВыбранныеФайлы = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Ждать ПолучитьФайлССервераАсинх(АдресФайла, ВыбранныеФайлы[0]);
	#КонецЕсли
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
