
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	АдресДанных = ВыгрузитьВФайлНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	
	Фильтр = НСтр("ru='Правило сравнения данных|*.xml|Все файлы|*'");
	ОбщегоНазначенияСравнительКлиент.СохранитьФайлНаУстройствоАсинх(АдресДанных, Объект.Наименование + ".xml", Фильтр);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВыгрузитьВФайлНаСервере(Знач Ссылка, Знач ИдентификаторФормы)
	ПравилоСравненияXDTO = Справочники.ПравилаСравненияДанных.ВыгрузитьВОбъектXDTO(Ссылка);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПравилоСравненияXDTO);
	
	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ЗаписьXML.Закрыть());
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
КонецФункции

#КонецОбласти
